import 'package:flutter/material.dart';

class Page7 extends StatelessWidget {
  const Page7({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('টিকা সম্পর্কিত তথ্য় :'),
      ),
      body: SingleChildScrollView(
        child: Column(
          children: const [
            Image(image: NetworkImage('https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSIJiAK6o9QYjKWrsS43-QKIkX48tK28IC36A&usqp=CAU')),
            Text('  হাঁস-মুরগির টিকাদান কর্মসূচি:\n  আসসালামু আলাইকুম,হ্যালো ভিজিটর আশাকরি সবাই ভালো আছেন।\n  আজকে বিভিন্ন মুরগির টিকা প্রদান বিষয়ে আলোচনা করব।আমাদের দেশে কিছু মানুষ আবেগের বশে কৃষি কাজে আসে ।\n কোন রকম তথ্য - উপাত্ত, অভিজ্ঞ্যতা ছাড়াই খামার প্রতিষ্ঠা করে ফেলে এবং খামার প্রতিষ্ঠার কোন নিয়মের তোয়াক্কা করে না ।\n  মানে না অভিজ্ঞদের পরামর্শ। যার ফল বেশীরভাগ ক্ষেত্রেই লোকসান । \n  খামার স্থাপনের আগে তার ঝুঁকি ও নিরাপত্তা সম্পর্কে জেনে শুনে শুরু করলে, লাভের সম্ভবনা বেড়ে যায় ।\n   টিকা প্রদান ও তার গুরুত্বঃটিকা প্রদান কর্মসূচি অনুসারে বিভিন্ন রোগের টিকা প্রদান করলে শরীরে রোগ প্রতিরোধ ক্ষমতা সৃষ্টি হয় এবং সংক্রামক রোগ হতে মুরগিকে রক্ষা করা যায়।\n  টিকাদান ফলপ্রসূ হলে রোগের প্রাদুর্ভাব খুব কম হবে এবং মৃত্যুর হার সহনীয় পর্যায় রাখা যাবে।হাঁস: ডাক প্লেগ, ডাক কলেরালেয়ার\n  মুরগির টিকাঃ মারেক্স, রাণীক্ষেত, গামবোরো, ব্রংকাইটিস, বসন্ত, সালমোনেলা, করাইজা ।ব্রয়লার মুরগির টিকাঃ\n  মারেক্স, রাণীক্ষেত, গামবোরোটিকা প্রদানের পূর্বে সতর্কতাঃ\n* হাঁস-মুরগি ধরার সময় যত্ন সহকারে ধরতে হবে ।\n* হাঁস-মুরগির যে কোন ধরনের ধকল মুক্ত অবস্থায় টিকা প্রয়োগ করতে হবে ।\n* অসুস্থ হাঁস-মুরগিকে টিকা দেয়া যাবে না ।\n* টিকা প্রদান উপকরণ ফুটন্ত পানিতে সিদ্ধ করে নিতে হবে ।\n* আবহাওয়া যখন ঠান্ডা সেসময়ে টিকা প্রদান করতে হবে(ভোর বা রাতে)\n* টিকা দেওয়ার কাজে ব্যবহৃত যন্ত্রপাতি কোন ভাবেই জীবণুনাশক দিয়ে ধৌত করা যাবে না|\nচিত্র: টিকা-১\nকিশোরগঞ্জ হাঁস প্রজনন খামার এন্ড হ্যাচারী লি:\nচিত্রঃ টিকা-২\nকিশোরগঞ্জ হাঁস প্রজনন খামার এন্ড হ্যাচারী লি:\nটিকা ব্যবহারের সাধারণ নিয়মাবলীঃ\n* প্রতিষেধক টিকা সবসময়ই সুস্থ পাখিকে প্রয়োগ করতে হয় ।\n* সংক্রামক রোগ বা কৃমিতে আক্রান্ত পশু-পাখিকে টিকা প্রয়োগ করা যাবে না। তাতে কাঙ্খিত মাত্রায় প্রতিরোধ ক্ষমতা সৃষ্টি হয় না বরং পাখির আরও ক্ষতি হবার সম্ভাবনা থাকে ।\n* টিকা বীজ কোন অবস্থাতেই সূর্যালোকের সংস্পর্শে আনা যাবে না ।\n* ব্যবহারের সময় মিশ্রণ এবং প্রয়োগের ক্ষেত্রে পাত্র, সিরিঞ্জ-নিড্ল, ব্যবহৃত তরল পদার্থ, টিকা ব্যবহারকারীর হাত ইত্যাদি পরিস্কার-পরিচ্ছন্ন ও বীজাণুমুক্ত হওয়া প্রয়োজন।\n* জীবাণুমুক্তকরণের জন্য রাসায়নিক পদার্থ ব্যবহার করা যাবে না ।\n* প্রতিষেধক টিকা সকালে বা সন্ধ্যার সময় ঠান্ডা আবহাওয়ায় প্রয়োগ করা ভাল ।\n* ব্যবহারের জন্য গোলানোর পর যত তাড়াতাড়ি সম্ভব টিকা ব্যবহার করে ফেলা উচিত। গোলানোর পর গরমের দিনে ১ ঘন্টা এবং শীতের দিনে ২ ঘন্টার মধ্যে ব্যবহার করে ফেলতে হবে ।\n* মেয়াদ শেষ হয়ে গেলে বা টিকার সাধারণ রং পরিবর্তিত হয়ে গেলে সে টিকা আর ব্যবহার করা যাবে না ।\n* টিকা পরিবহনের ক্ষেত্রে ঠান্ডা অবস্থায় পরিবহন নিশ্চিত করা প্রয়োজন । তাপ প্রতিরোধক পাত্রের মধ্যে বরফ দিয়ে টিকা বীজ পরিবহন করতে হয়। বরফ গলে গেলে পুনরায় বরফ দিতে হয় ।\n* ব্যবহারের সময় টিকা মিশ্রণের পাত্র ছায়াযুক্ত স্থানে বরফ দেওয়া বড় পাত্রের মধ্যে রাখা যাবে না ।\n* ভাইরাস জনিত রোগ প্রতিরোধক টিকা প্রয়োগকালে টিকা প্রয়োগ স্থান পরিষ্কার পানি দ্বারা ধুয়ে নিতে হবে এবং এই জন্য রাসায়নিক দ্রব্য ব্যবহার করা যাবে না ।\n* গোলানো অব্যবহৃত টিকা পুড়িয়ে ফেলতে হবে। ভবিষ্যতে ব্যবহারের জন্য রাখা যাবে না।'
              , style: TextStyle(
                  color: Colors.black87, fontSize: 15 , fontWeight: FontWeight.bold),),
          ],
        ),
      ),
    );
  }
}
