import 'package:flutter/material.dart';

class Page6 extends StatelessWidget {
  const Page6({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: AppBar(
          title: const Text('Page 6'),
        ),
        body:
        SingleChildScrollView(
          child: Column(
            children: const [
              Image(image: NetworkImage('https://thumbs.dreamstime.com/z/black-colour-desi-indian-hen-chicks-beautiful-its-eating-rice-164743132.jpg'),
                height: 500,
                width: 600,
              ),
              Text('প্রতিবন্ধকতা ও সমাধান :',style: TextStyle(
                  color: Colors.black, fontSize: 30, fontWeight: FontWeight.bold),),Text(
          'মুরগি পালনে প্রধান প্রতিবন্ধকতা রাণীক্ষেত রোগ, এ রোগের প্রচলিত নাম চুনা মল ত্যাগ।পাখি হা করে ঠোঁট তুলে শ্বাস নেয়।'
              ' ঝিমুনী ও ধীরে ধীরে পক্ষাঘাত হয়।বড় মুরগির নাকে শব্দ হয়।ভাইরাস দ্বারা সংক্রমিত এই রোগটি মুরগির শ্বসনতন্ত্র ও স্নায়ুতন্ত্রের উপর বিশেষ আক্রমণ করে।'
              'রাণীক্ষেত রোগের লক্ষণ সমূহ:মুরগী খাওয়া বন্ধ করে দেয়।মাথা নিচু ও চোখ বন্ধ করে ঝিমাতে থাকে।সাদা চুনের মত পাতলা মল ত্যাগ করে।নাক দিয়ে সর্দি ও মুখ দিয়ে লালা ঝরে।'
              'শ্বাস প্রশ্বাস দ্রুত হয় এবং হা করে নিঃশ্বাস নেয়।ঘাড় বেঁকে যায়, কখনও কখনও একই স্থানে দাঁড়িয়ে চক্রাকারে ঘুরতে থাকে।মুরগী দূর্বল হয়ে ঠোঁট ও বুক মাটিতে লাগিয়ে বসে পড়ে।'
              'রাণীক্ষেত রোগের প্রতিরোধ ও চিকিৎসা:প্রতিষেধক টিকা প্রয়োগ এ রোগের হাত থেকে পরিত্রাণের একমাত্র উপায়।রোগাক্রান্ত মোরগ-মুরগীর ক্ষেত্রে দ্বিতীয় পর্যায়ের ব্যাকটেরিয়ার সংক্রমণ'
              ' থেকে রক্ষা করার জন্য উচচক্ষমতা সম্পন্ন এন্টিবায়োটিক ব্যবহার করা যেতে পারে।আক্রান্ত মুরগীকে অবশ্যই অন্যান্য মুরগীর সংস্পর্ষ থেকে সরিয়ে ফেলতে হবে।'
              ' মরে যাওয়া মুরগী ২-৩ হাত মাটির নীচে পুঁতে ফেলতে হবে।',style: TextStyle(
          color: Colors.black, fontSize: 20, fontWeight: FontWeight.bold),),Text('অন্যান্য সুবিধাসমূহ :',style: TextStyle(
    color: Colors.redAccent, fontSize: 30, fontWeight: FontWeight.bold),),Text('শের আর্থসামাজিক উন্নয়নে মুরগির গুরুত্ব অপরিসীম। তুলনামূলক স্বল্প বিনিয়োগ এবং অল্প ভূমিতে'
              ' বাস্তবায়নযোগ্য বিধায় জাতীয় অর্থনীতিতে এর গুরুত্ব উত্তোরোত্তর বৃদ্ধি পাচ্ছে।মুরগি পালন, বেকার যুব সমাজ, ভূমিহীন কৃষক এবং দুস্হ গ্রামীন মহিলাদের আত্ম-কর্মসংস্হানের একটি উল্লেখযোগ্য উপায়।'
              'দেশের অধিকাংশ মানুষ পুষ্টি সমস্যায় আক্রান্ত। মুরগির মাংস ও ডিম উন্নতমানের প্রাণিজ আমিষের উৎস। মাংস ও ডিমের মাধ্যমে প্রাণিজ আমিষের ঘাটতি পূরণ করে এই সমস্যা সমাধান করা যায়।'
              'আদিকাল থেকে গ্রাম বাংলার মহিলারা বাড়তি আয়ের উৎস হিসাবে মুরগি পালন করে আসছে।মুরগির বিষ্ঠা উন্নতমানের জৈব সার যা ব্যবহার করে কৃষি ফসল উৎপাদনে লাভবান হওয়া যায়।'
              'মুরগির পালক দ্বারা খেলার সামগ্রী, ঝাড়- ইত্যাদি এবং রক্ত ও নাড়িভূড়ি প্রক্রিয়াজাত করে পশু-পাখীর খাদ্য তৈরীর জন্য আলাদা শিল্প গড়ে উঠেছে।'
              'মুরগির বর্জ্য এবং লিটার ব্যবহার করে বায়োগ্যাস উৎপাদন করা সম্ভব যা ব্যবহারের মাধ্যমে জ্বালানী সাশ্রয় করে জাতীয় অর্থনীতিতে ভূমিকা রাখা যায়',style: TextStyle(
                  color: Colors.black, fontSize: 20, fontWeight: FontWeight.bold),),
            ],
          ),
        )

    );
  }
}
