import 'package:flutter/material.dart';

class Page12 extends StatelessWidget {
  const Page12({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: AppBar(
          title: const Text('ডিম সংরক্ষণ ও বাছাই :'),
        ),
        body:
        SingleChildScrollView(
          child: Column(
            children: const [
              Image(image: NetworkImage('https://c8.alamy.com/comp/DD5D53/chickens-inside-hen-house-on-a-farm-in-new-zealand-DD5D53.jpg'),
                height: 500,
                width: 600,
              ),
              Text('ডিম নষ্ট হওয়ার কারণ ও সমাধান:-\n ডিমের মোটা মাথাটায় কিছুটা জায়গা জুড়ে বাতাস থাকে। এই বাতাসে অক্সিজেন কমে কার্বন ডাই-অক্সাইড বেড়ে গেলেই ডিম পচে যায়। আরেকটি কারণ হলো- ডিমের খোসায় অজস্র ফুটা থাকে, ঐ ফুটা দিয়ে যেমন বাতাস ঢোকে, বাতাসের সঙ্গে জীবাণু ঢুকে যায়। ঐ জীবাণুই ডিমকে পচিয়ে দেয়। ডিমের টাটকাভাব পরিবেশের উপর নির্ভর করে ঠাÐায় যেমন টাটকা থাকে, গরমে তাড়াতাড়ি নষ্ট হয়।ডিম সংরক্ষণডিমের মূল গুণাগুণ বজায় রাখতে সঠিক নিয়মে সংরক্ষণ করা প্রয়োজন। দিনে ৩-৪ বার ডিম সংগ্রহ করতে হবে। গরমকালে ডিম সংগ্রহের পরই যতটা সম্ভব ঠাÐা জায়গায় জড়ো করতে হবে। কিছু দিনের জন্য রাখতে চাইলে ১২.৮ ডিগ্রি সে. তাপমাত্রায় এবং মাসের পর মাস ডিম রাখতে চাইলে ১.৭-০.৬ ডিগ্রি সে. তাপমাত্রায় সংরক্ষণ করতে হবে। ঠাÐা ঘরের আর্দ্রতা হবে ৮৫%।আধুনিক পদ্ধতিতে ঘরের তাপমাত্রা নিয়ন্ত্রণের মাধ্যমে ডিম সংরক্ষণ করা গ্রামীণ পরিবেশে সম্ভব নয়, কারণ এতে যে প্রযুক্তি ও আধুনিক সরঞ্জামের প্রয়োজন তা আমাদের নেই। তাই সংরক্ষণের আধুনিক পদ্ধতিকে এড়িয়ে দেশিয় উপযোগী পদ্ধতি ব্যবহারের দিকে নজর রাখা দরকার, যাতে করে গ্রামাঞ্চলে সাধারণ মানুষের পক্ষে তা প্রয়োগ করা সম্ভব হয়। (ক) সোডিয়াম সিলিকেট দ্বারা সংরক্ষণ-ভালো ডিম বাছাই করে তরল সোডিয়াম সিলিকেটে সংরক্ষণ করা হয়। এ পদ্ধতিতে ১ কেজি সোডিয়াম সিলিকেট ১০ লিটার পানিতে ভালোভাবে গুলে তরল করা হয়। এই তরলে ১৫ ডজন ডিম সংরক্ষণ করা যায়। বাংলাদেশের আবহাওয়ায় আড়াই মাস পর্যন্ত ডিম ভালো থাকে।(খ) চুনের পানি দ্বারা সংরক্ষণ- এ পদ্ধতিতে ১ কেজি চুন ২০ লিটার পানিতে গুলে ১০ মিনিট থিতাল হয়। চুনের পানিতে ডিম  ডুবিয়ে রাখা হয়। এ উপায়ে ২ মাস পর্যন্ত ডিম সংরক্ষণ করা যায়।(গ) তেল দ্বারা সংরক্ষণ- এ পদ্ধতিতে বর্ণ, স্বাদ ও গন্ধহীন নারিকেল বা সয়াবিন তেল ব্যবহার করা হয়। তেলে ডিমগুলো ডুবিয়ে পরে অন্য পাত্রে উঠিয়ে রাখা হয়। এ পদ্ধতিতে ডিম পাড়ার পর পরই সংরক্ষণ করতে হয়। এভাবে প্রায় এক মাস পর্যন্ত ডিমের গুণাগুণ অক্ষুণœ রাখা সম্ভব। প্যারাফিন ডিমে মাখিয়ে এটাই করা সম্ভব।(ঘ) গরম পানি দ্বারা সংরক্ষণ- এ পদ্ধতিতে ১৩০ ডিগ্রি ফারেনহাইট গরম পানিতে ১৫ মিনিট অথবা ১৪০ ডিগ্রি ফারেনহাইট গরম পানিতে ৩-৫ মিনিট ডিম রেখে তারপর অন্য পাত্রে উঠিয়ে রাখা ভালো। এতে এক মাস পর্যন্ত ডিমের গুণাগুণ অক্ষুণœ থাকে।এ গুলো ছাড়াও আধুনিক সংরক্ষণ পদ্ধতির মধ্যে রয়েছে হিমায়িত শুষ্ক ডিম। ডিমকে পুরোপুরি শুকনো করার ব্যবস্থা এখন আরও বেশি চালু। স্থানান্তর করতে জায়গা যেমন কম লাগে ঠিক তেমনি ঠাÐা ঘরের কোন দরকার পড়ে না। তবে প্রক্রিয়ার মূলধন বেশি লাগে।ডিম বিপণন প্রণালিডিম উৎপাদক থেকে ভোক্তা পর্যন্ত পৌঁছতে বেশ কিছু দিন সময় প্রয়োজন হয় অথবা বাজারমূল্য একেবারে কমে গেলে অতিরিক্ত ডিম অনেক দিন রাখতে হয়, এ জন্য খামারি, ব্যবসায়ীদের সংরক্ষণ পদ্ধতি বিষয়ে সঠিক ধারণা থাকা প্রয়োজন। নিরাপদ, স্বাস্থ্যসম্মত ডিম প্রাপ্যতা সকল ভোক্তারই প্রত্যাশা।',style: TextStyle(
                  color: Colors.black, fontSize: 20, fontWeight: FontWeight.bold),),
            ],
          ),
        )

    );
  }
}
